# Exercises Numpy
## Sales Reports

In [42]:
# Import library
import pandas as pd
import numpy as np

In [62]:
# Create ndarray
np.random.seed(42)
data = np.random.randint(20, size=(7, 3))
data.T

array([[ 6, 10, 18,  3,  1,  1, 11],
       [19,  7, 10,  7, 11,  0, 16],
       [14,  6, 10,  2,  5, 11,  9]], dtype=int32)

In [59]:
# Create data frame
df = pd.DataFrame(data=data, index=["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"], columns=["Water Melon", "Apple", "Orange"])
df

     Water Melon  Apple  Orange
Sun            6     19      14
Mon           10      7       6
Tue           18     10      10
Wed            3      7       2
Thu            1     11       5
Fri            1      0      11
Sat           11     16       9

In [60]:
# Price per items
price = np.array([12, 5, 3])
df_price = pd.DataFrame(data=price.reshape(1, 3), index=["Price"], columns=["Water Melon", "Apple", "Orange"])
df_price

       Water Melon  Apple  Orange
Price           12      5       3

In [66]:
# Total Revenue
total = price.dot(data.T)
total

array([209, 173, 296,  77,  82,  45, 239])

In [67]:
# Create new Total price columns
df["Total $"] = total
df

     Water Melon  Apple  Orange  Total $
Sun            6     19      14      209
Mon           10      7       6      173
Tue           18     10      10      296
Wed            3      7       2       77
Thu            1     11       5       82
Fri            1      0      11       45
Sat           11     16       9      239